LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
/*
 * ESP8266mDNS Structs.cpp
 *
 *  License (MIT license):
 *    Permission is hereby granted, free of charge, to any person obtaining a copy
 *    of this software and associated documentation files (the "Software"), to deal
 *    in the Software without restriction, including without limitation the rights
 *    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *    copies of the Software, and to permit persons to whom the Software is
 *    furnished to do so, subject to the following conditions:
 *
 *    The above copyright notice and this permission notice shall be included in
 *    all copies or substantial portions of the Software.
 *
 *    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 *    THE SOFTWARE.
 *
 */

#include "ESP8266mDNS-Priv.h"


/*
 * namespace LEA_MDNSResponder
 */
namespace LEA_MDNSResponder {

/**
 * STRUCTS
 */

/**
 * MDNSResponder::stcMDNSServiceTxt
 *
 * One MDNS TXT item.
 * m_pcValue may be '\0'.
 * Objects can be chained together (list, m_pNext).
 * A 'm_bTemp' flag differentiates between static and dynamic items.
 * Output as byte array 'c#=1' is supported.
 */

/*
 * MDNSResponder::stcMDNSServiceTxt::_stcMDNSServiceTxt constructor
 */
MDNSResponder::_stcMDNSServiceTxt::_stcMDNSServiceTxt(const char* p_pcKey /*= 0*/,
                                  const char* p_pcValue /*= 0*/,
                                  bool p_bTemp /*= false*/)
:   m_pNext(0),
    m_pcKey(0),
    m_pcValue(0),
    m_bTemp(p_bTemp) {
    
    setKey(p_pcKey);
    setValue(p_pcValue);
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::_stcMDNSServiceTxt copy-constructor
 */
MDNSResponder::_stcMDNSServiceTxt::_stcMDNSServiceTxt(const MDNSResponder::_stcMDNSServiceTxt& p_Other)
:   m_pNext(0),
    m_pcKey(0),
    m_pcValue(0),
    m_bTemp(false) {
    
    operator=(p_Other);
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::~_stcMDNSServiceTxt destructor
 */
MDNSResponder::_stcMDNSServiceTxt::~_stcMDNSServiceTxt(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::operator=
 */
MDNSResponder::_stcMDNSServiceTxt& MDNSResponder::_stcMDNSServiceTxt::operator=(const MDNSResponder::_stcMDNSServiceTxt& p_Other) {

    if (&p_Other != this) {
        clear();
        set(p_Other.m_pcKey, p_Other.m_pcValue, p_Other.m_bTemp);
    }
    return *this;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::clear
 */
bool MDNSResponder::_stcMDNSServiceTxt::clear(void) {
    
    releaseKey();
    releaseValue();
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::allocKey
 */
char* MDNSResponder::_stcMDNSServiceTxt::allocKey(size_t p_stLength) {
    
    releaseKey();
    if (p_stLength) {
        m_pcKey = new char[p_stLength + 1];
    }
    return m_pcKey;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::setKey
 */
bool MDNSResponder::_stcMDNSServiceTxt::setKey(const char* p_pcKey,
                                               size_t p_stLength) {
    
    bool bResult = false;
    
    releaseKey();
    if (p_stLength) {
        if (allocKey(p_stLength)) {
            os_strncpy(m_pcKey, p_pcKey, p_stLength);
            m_pcKey[p_stLength] = 0;
            bResult = true;
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::setKey
 */
bool MDNSResponder::_stcMDNSServiceTxt::setKey(const char* p_pcKey) {
    
    return setKey(p_pcKey, (p_pcKey ? os_strlen(p_pcKey) : 0));
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::releaseKey
 */
bool MDNSResponder::_stcMDNSServiceTxt::releaseKey(void) {
    
    if (m_pcKey) {
        delete[] m_pcKey;
        m_pcKey = 0;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::allocValue
 */
char* MDNSResponder::_stcMDNSServiceTxt::allocValue(size_t p_stLength) {
    
    releaseValue();
    if (p_stLength) {
        m_pcValue = new char[p_stLength + 1];
    }
    return m_pcValue;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::setValue
 */
bool MDNSResponder::_stcMDNSServiceTxt::setValue(const char* p_pcValue,
                                                 size_t p_stLength) {
    
    bool bResult = false;
    
    releaseValue();
    if (p_stLength) {
        if (allocValue(p_stLength)) {
            os_strncpy(m_pcValue, p_pcValue, p_stLength);
            m_pcValue[p_stLength] = 0;
            bResult = true;
        }
    }
    else {  // No value -> also OK
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::setValue
 */
bool MDNSResponder::_stcMDNSServiceTxt::setValue(const char* p_pcValue) {
    
    return setValue(p_pcValue, (p_pcValue ? os_strlen(p_pcValue) : 0));
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::releaseValue
 */
bool MDNSResponder::_stcMDNSServiceTxt::releaseValue(void) {
    
    if (m_pcValue) {
        delete[] m_pcValue;
        m_pcValue = 0;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::set
 */
bool MDNSResponder::_stcMDNSServiceTxt::set(const char* p_pcKey,
                                            const char* p_pcValue,
                                            bool p_bTemp /*= false*/) {
    
    m_bTemp = p_bTemp;
    return ((setKey(p_pcKey)) &&
            (setValue(p_pcValue)));
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::update
 */
bool MDNSResponder::_stcMDNSServiceTxt::update(const char* p_pcValue) {
    
    return setValue(p_pcValue);
}

/*
 * MDNSResponder::_stcMDNSServiceTxt::length
 *
 * length of eg. 'c#=1' without any closing '\0'
 */
size_t MDNSResponder::_stcMDNSServiceTxt::length(void) const {

    size_t  stLength = 0;
    if (m_pcKey) {
        stLength += os_strlen(m_pcKey);                     // Key
        stLength += 1;                                      // '='
        stLength += (m_pcValue ? os_strlen(m_pcValue) : 0); // Value
    }
    return stLength;
}

    
/**
 * MDNSResponder::stcMDNSServiceTxts
 *
 * A list of zero or more MDNS TXT items.
 * Dynamic TXT items can be removed by 'removeTempTxts'.
 * A TXT item can be looke up by its 'key' member.
 * Export as ';'-separated byte array is supported.
 * Export as 'length byte coded' byte array is supported.
 * Comparision ((all A TXT items in B and equal) AND (all B TXT items in A and equal)) is supported.
 *
 */

