LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
/*
 * MDNSResponder::_stcMDNSServiceTxts::_stcMDNSServiceTxts contructor
 */
MDNSResponder::_stcMDNSServiceTxts::_stcMDNSServiceTxts(void)
:   m_pTxts(0) {
    
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::_stcMDNSServiceTxts copy-constructor
 */
MDNSResponder::_stcMDNSServiceTxts::_stcMDNSServiceTxts(const _stcMDNSServiceTxts& p_Other)
:   m_pTxts(0) {
    
    operator=(p_Other);
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::~_stcMDNSServiceTxts destructor
 */
MDNSResponder::_stcMDNSServiceTxts::~_stcMDNSServiceTxts(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::operator=
 */
MDNSResponder::_stcMDNSServiceTxts& MDNSResponder::_stcMDNSServiceTxts::operator=(const _stcMDNSServiceTxts& p_Other) {

    if (this != &p_Other) {
        clear();
        
        for (stcMDNSServiceTxt* pOtherTxt=p_Other.m_pTxts; pOtherTxt; pOtherTxt=pOtherTxt->m_pNext) {
            add(new stcMDNSServiceTxt(*pOtherTxt));
        }
    }
    return *this;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::clear
 */
bool MDNSResponder::_stcMDNSServiceTxts::clear(void) {
    
    while (m_pTxts) {
        stcMDNSServiceTxt* pNext = m_pTxts->m_pNext;
        delete m_pTxts;
        m_pTxts = pNext;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::add
 */
bool MDNSResponder::_stcMDNSServiceTxts::add(MDNSResponder::stcMDNSServiceTxt* p_pTxt) {
    
    bool bResult = false;
    
    if (p_pTxt) {
        p_pTxt->m_pNext = m_pTxts;
        m_pTxts = p_pTxt;
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::remove
 */
bool MDNSResponder::_stcMDNSServiceTxts::remove(stcMDNSServiceTxt* p_pTxt) {
    
    bool    bResult = false;
    
    if (p_pTxt) {
        stcMDNSServiceTxt*  pPred = m_pTxts;
        while ((pPred) &&
               (pPred->m_pNext != p_pTxt)) {
            pPred = pPred->m_pNext;
        }
        if (pPred) {
            pPred->m_pNext = p_pTxt->m_pNext;
            delete p_pTxt;
            bResult = true;
        }
        else if (m_pTxts == p_pTxt) {   // No predecesor, but first item
            m_pTxts = p_pTxt->m_pNext;
            delete p_pTxt;
            bResult = true;
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::removeTempTxts
 */
bool MDNSResponder::_stcMDNSServiceTxts::removeTempTxts(void) {

    bool    bResult = true;
    
    stcMDNSServiceTxt*  pTxt = m_pTxts;
    while ((bResult) &&
           (pTxt)) {
        stcMDNSServiceTxt*  pNext = pTxt->m_pNext;
        if (pTxt->m_bTemp) {
            bResult = remove(pTxt);
        }
        pTxt = pNext;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::find
 */
MDNSResponder::stcMDNSServiceTxt* MDNSResponder::_stcMDNSServiceTxts::find(const char* p_pcKey) {
    
    _stcMDNSServiceTxt* pResult = 0;
    
    for (stcMDNSServiceTxt* pTxt=m_pTxts; pTxt; pTxt=pTxt->m_pNext) {
        if ((p_pcKey) &&
            (0 == strcmp(pTxt->m_pcKey, p_pcKey))) {
            pResult = pTxt;
            break;
        }
    }
    return pResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::find
 */
const MDNSResponder::stcMDNSServiceTxt* MDNSResponder::_stcMDNSServiceTxts::find(const char* p_pcKey) const {
    
    const _stcMDNSServiceTxt*   pResult = 0;
    
    for (const stcMDNSServiceTxt* pTxt=m_pTxts; pTxt; pTxt=pTxt->m_pNext) {
        if ((p_pcKey) &&
            (0 == strcmp(pTxt->m_pcKey, p_pcKey))) {
            
            pResult = pTxt;
            break;
        }
    }
    return pResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::find
 */
MDNSResponder::stcMDNSServiceTxt* MDNSResponder::_stcMDNSServiceTxts::find(const stcMDNSServiceTxt* p_pTxt) {
    
    _stcMDNSServiceTxt* pResult = 0;
    
    for (stcMDNSServiceTxt* pTxt=m_pTxts; pTxt; pTxt=pTxt->m_pNext) {
        if (p_pTxt == pTxt) {
            pResult = pTxt;
            break;
        }
    }
    return pResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::length
 */
uint16_t MDNSResponder::_stcMDNSServiceTxts::length(void) const {
    
    uint16_t    u16Length = 0;

    stcMDNSServiceTxt*  pTxt = m_pTxts;
    while (pTxt) {
        u16Length += 1;                 // Length byte
        u16Length += pTxt->length();    // Text
        pTxt = pTxt->m_pNext;
    }
    return u16Length;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::c_strLength
 *
 * (incl. closing '\0'). Length bytes place is used for delimiting ';' and closing '\0'
 */
size_t MDNSResponder::_stcMDNSServiceTxts::c_strLength(void) const {
    
    return length();
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::c_str
 */
bool MDNSResponder::_stcMDNSServiceTxts::c_str(char* p_pcBuffer) {
    
    bool bResult = false;
    
    if (p_pcBuffer) {
        bResult = true;
        
        *p_pcBuffer = 0;
        for (stcMDNSServiceTxt* pTxt=m_pTxts; ((bResult) && (pTxt)); pTxt = pTxt->m_pNext) {
            size_t  stLength;
            if ((bResult = (0 != (stLength = (pTxt->m_pcKey ? os_strlen(pTxt->m_pcKey) : 0))))) {
                if (pTxt != m_pTxts) {
                    *p_pcBuffer++ = ';';
                }
                os_strncpy(p_pcBuffer, pTxt->m_pcKey, stLength); p_pcBuffer[stLength] = 0;
                p_pcBuffer += stLength;
                *p_pcBuffer++ = '=';
                if ((stLength = (pTxt->m_pcValue ? os_strlen(pTxt->m_pcValue) : 0))) {
                    os_strncpy(p_pcBuffer, pTxt->m_pcValue, stLength); p_pcBuffer[stLength] = 0;
                    p_pcBuffer += stLength;
                }
            }
        }
        *p_pcBuffer++ = 0;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::bufferLength
 *
 * (incl. closing '\0').
 */
size_t MDNSResponder::_stcMDNSServiceTxts::bufferLength(void) const {
    
    return (length() + 1);
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::toBuffer
 */
bool MDNSResponder::_stcMDNSServiceTxts::buffer(char* p_pcBuffer) {
    
    bool bResult = false;

    if (p_pcBuffer) {
        bResult = true;
        
