LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
        *p_pcBuffer = 0;
        for (stcMDNSServiceTxt* pTxt=m_pTxts; ((bResult) && (pTxt)); pTxt = pTxt->m_pNext) {
            *(unsigned char*)p_pcBuffer++ = pTxt->length();
            size_t  stLength;
            if ((bResult = (0 != (stLength = (pTxt->m_pcKey ? os_strlen(pTxt->m_pcKey) : 0))))) {
                os_memcpy(p_pcBuffer, pTxt->m_pcKey, stLength);
                p_pcBuffer += stLength;
                *p_pcBuffer++ = '=';
                if ((stLength = (pTxt->m_pcValue ? os_strlen(pTxt->m_pcValue) : 0))) {
                    os_memcpy(p_pcBuffer, pTxt->m_pcValue, stLength);
                    p_pcBuffer += stLength;
                }
            }
        }
        *p_pcBuffer++ = 0;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::compare
 */
bool MDNSResponder::_stcMDNSServiceTxts::compare(const MDNSResponder::_stcMDNSServiceTxts& p_Other) const {

    bool    bResult = false;

    if ((bResult = (length() == p_Other.length()))) {
        // Compare A->B
        for (const stcMDNSServiceTxt* pTxt=m_pTxts; ((bResult) && (pTxt)); pTxt=pTxt->m_pNext) {
            const stcMDNSServiceTxt*    pOtherTxt = p_Other.find(pTxt->m_pcKey);
            bResult = ((pOtherTxt) &&
                       (pTxt->m_pcValue) &&
                       (pOtherTxt->m_pcValue) &&
                       (os_strlen(pTxt->m_pcValue) == os_strlen(pOtherTxt->m_pcValue)) &&
                       (0 == strcmp(pTxt->m_pcValue, pOtherTxt->m_pcValue)));
        }
        // Compare B->A
        for (const stcMDNSServiceTxt* pOtherTxt=p_Other.m_pTxts; ((bResult) && (pOtherTxt)); pOtherTxt=pOtherTxt->m_pNext) {
            const stcMDNSServiceTxt*    pTxt = find(pOtherTxt->m_pcKey);
            bResult = ((pTxt) &&
                       (pOtherTxt->m_pcValue) &&
                       (pTxt->m_pcValue) &&
                       (os_strlen(pOtherTxt->m_pcValue) == os_strlen(pTxt->m_pcValue)) &&
                       (0 == strcmp(pOtherTxt->m_pcValue, pTxt->m_pcValue)));
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::operator==
 */
bool MDNSResponder::_stcMDNSServiceTxts::operator==(const _stcMDNSServiceTxts& p_Other) const {
    
    return compare(p_Other);
}

/*
 * MDNSResponder::_stcMDNSServiceTxts::operator!=
 */
bool MDNSResponder::_stcMDNSServiceTxts::operator!=(const _stcMDNSServiceTxts& p_Other) const {
    
    return !compare(p_Other);
}


/**
 * MDNSResponder::stcMDNS_MsgHeader
 *
 * A MDNS message haeder.
 *
 */

/*
 * MDNSResponder::_stcMDNS_MsgHeader::_stcMDNS_MsgHeader
 */
MDNSResponder::_stcMDNS_MsgHeader::_stcMDNS_MsgHeader(uint16_t p_u16ID /*= 0*/,
                                                      bool p_bQR /*= false*/,
                                                      unsigned char p_ucOpcode /*= 0*/,
                                                      bool p_bAA /*= false*/,
                                                      bool p_bTC /*= false*/,
                                                      bool p_bRD /*= false*/,
                                                      bool p_bRA /*= false*/,
                                                      unsigned char p_ucRCode /*= 0*/,
                                                      uint16_t p_u16QDCount /*= 0*/,
                                                      uint16_t p_u16ANCount /*= 0*/,
                                                      uint16_t p_u16NSCount /*= 0*/,
                                                      uint16_t p_u16ARCount /*= 0*/)
:   m_u16ID(p_u16ID),
    m_1bQR(p_bQR), m_4bOpcode(p_ucOpcode), m_1bAA(p_bAA), m_1bTC(p_bTC), m_1bRD(p_bRD),
    m_1bRA(p_bRA), m_3bZ(0), m_4bRCode(p_ucRCode),
    m_u16QDCount(p_u16QDCount),
    m_u16ANCount(p_u16ANCount),
    m_u16NSCount(p_u16NSCount),
    m_u16ARCount(p_u16ARCount) {

}


/**
 * MDNSResponder::stcMDNS_RRDomain
 *
 * A MDNS domain object.
 * The labels of the domain are stored (DNS-like encoded) in 'm_acName':
 * [length byte]varlength label[length byte]varlength label[0]
 * 'm_u16NameLength' stores the used length of 'm_acName'.
 * Dynamic label addition is supported.
 * Comparison is supported.
 * Export as byte array 'esp8266.local' is supported.
 *
 */

/*
 * MDNSResponder::_stcMDNS_RRDomain::_stcMDNS_RRDomain constructor
 */
MDNSResponder::_stcMDNS_RRDomain::_stcMDNS_RRDomain(void)
:   m_u16NameLength(0) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::_stcMDNS_RRDomain copy-constructor
 */
MDNSResponder::_stcMDNS_RRDomain::_stcMDNS_RRDomain(const _stcMDNS_RRDomain& p_Other)
:   m_u16NameLength(0) {
    
    operator=(p_Other);
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::operator =
 */
MDNSResponder::_stcMDNS_RRDomain& MDNSResponder::_stcMDNS_RRDomain::operator=(const _stcMDNS_RRDomain& p_Other) {
    
    if (&p_Other != this) {
        memcpy(m_acName, p_Other.m_acName, sizeof(m_acName));
        m_u16NameLength = p_Other.m_u16NameLength;
    }
    return *this;
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::clear
 */
bool MDNSResponder::_stcMDNS_RRDomain::clear(void) {
    
    memset(m_acName, 0, sizeof(m_acName));
    m_u16NameLength = 0;
    return true;
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::addLabel
 */
bool MDNSResponder::_stcMDNS_RRDomain::addLabel(const char* p_pcLabel,
                                                bool p_bPrependUnderline /*= false*/) {
    
    bool    bResult = false;    
    
    size_t  stLength = (p_pcLabel
                        ? (os_strlen(p_pcLabel) + (p_bPrependUnderline ? 1 : 0))
                        : 0);
    if ((MDNS_DOMAIN_LABEL_MAXLENGTH >= stLength) &&
        (MDNS_DOMAIN_MAXLENGTH >= (m_u16NameLength + (1 + stLength)))) {
        // Length byte
        m_acName[m_u16NameLength] = (unsigned char)stLength;    // Might be 0!
        ++m_u16NameLength;
        // Label
        if (stLength) {
            if (p_bPrependUnderline) {
                m_acName[m_u16NameLength++] = '_';
                --stLength;
            }
            os_strncpy(&(m_acName[m_u16NameLength]), p_pcLabel, stLength); m_acName[m_u16NameLength + stLength] = 0;
            m_u16NameLength += stLength;
        }
        bResult = true;
    }
    return bResult;
}

