LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
/*
 * MDNSResponder::_stcMDNS_RRDomain::compare
 */
bool MDNSResponder::_stcMDNS_RRDomain::compare(const _stcMDNS_RRDomain& p_Other) const {
    
    bool    bResult = false;
    
    if (m_u16NameLength == p_Other.m_u16NameLength) {
        const char* pT = m_acName;
        const char* pO = p_Other.m_acName;
        while ((pT) &&
               (pO) &&
               (*((unsigned char*)pT) == *((unsigned char*)pO)) &&                  // Same length AND
               (0 == lwip_strnicmp((pT + 1), (pO + 1), *((unsigned char*)pT)))) {   // Same content
            if (*((unsigned char*)pT)) {            // Not 0
                pT += (1 + *((unsigned char*)pT));  // Shift by length byte and lenght
                pO += (1 + *((unsigned char*)pO));
            }
            else {                                  // Is 0 -> Successfully reached the end
                bResult = true;
                break;
            }
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::operator ==
 */
bool MDNSResponder::_stcMDNS_RRDomain::operator==(const _stcMDNS_RRDomain& p_Other) const {
    
    return compare(p_Other);
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::operator !=
 */
bool MDNSResponder::_stcMDNS_RRDomain::operator!=(const _stcMDNS_RRDomain& p_Other) const {
    
    return !compare(p_Other);
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::operator >
 */
bool MDNSResponder::_stcMDNS_RRDomain::operator>(const _stcMDNS_RRDomain& p_Other) const {

    // TODO: Check, if this is a good idea...
    return !compare(p_Other);
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::c_strLength
 */
size_t MDNSResponder::_stcMDNS_RRDomain::c_strLength(void) const {
    
    size_t          stLength = 0;
    
    unsigned char*  pucLabelLength = (unsigned char*)m_acName;
    while (*pucLabelLength) {
        stLength += (*pucLabelLength + 1 /* +1 for '.' or '\0'*/);
        pucLabelLength += (*pucLabelLength + 1);
    }
    return stLength;
}

/*
 * MDNSResponder::_stcMDNS_RRDomain::c_str
 */
bool MDNSResponder::_stcMDNS_RRDomain::c_str(char* p_pcBuffer) {
    
    bool bResult = false;
    
    if (p_pcBuffer) {
        *p_pcBuffer = 0;
        unsigned char* pucLabelLength = (unsigned char*)m_acName;
        while (*pucLabelLength) {
            memcpy(p_pcBuffer, (const char*)(pucLabelLength + 1), *pucLabelLength);
            p_pcBuffer += *pucLabelLength;
            pucLabelLength += (*pucLabelLength + 1);
            *p_pcBuffer++ = (*pucLabelLength ? '.' : '\0');
        }
        bResult = true;
    }
    return bResult;
}


/**
 * MDNSResponder::stcMDNS_RRAttributes
 *
 * A MDNS attributes object.
 *
 */

/*
 * MDNSResponder::_stcMDNS_RRAttributes::_stcMDNS_RRAttributes constructor
 */
MDNSResponder::_stcMDNS_RRAttributes::_stcMDNS_RRAttributes(uint16_t p_u16Type /*= 0*/,
                                                            uint16_t p_u16Class /*= 1 DNS_RRCLASS_IN Internet*/)
:   m_u16Type(p_u16Type),
    m_u16Class(p_u16Class) {
    
}

/*
 * MDNSResponder::_stcMDNS_RRAttributes::_stcMDNS_RRAttributes copy-constructor
 */
MDNSResponder::_stcMDNS_RRAttributes::_stcMDNS_RRAttributes(const MDNSResponder::_stcMDNS_RRAttributes& p_Other) {
    
    operator=(p_Other);
}

/*
 * MDNSResponder::_stcMDNS_RRAttributes::operator =
 */
MDNSResponder::_stcMDNS_RRAttributes& MDNSResponder::_stcMDNS_RRAttributes::operator=(const MDNSResponder::_stcMDNS_RRAttributes& p_Other) {
    
    if (&p_Other != this) {
        m_u16Type = p_Other.m_u16Type;
        m_u16Class = p_Other.m_u16Class;
    }
    return *this;
}


/**
 * MDNSResponder::stcMDNS_RRHeader
 *
 * A MDNS record header (domain and attributes) object.
 *
 */

/*
 * MDNSResponder::_stcMDNS_RRHeader::_stcMDNS_RRHeader constructor
 */
MDNSResponder::_stcMDNS_RRHeader::_stcMDNS_RRHeader(void) {
    
}

/*
 * MDNSResponder::_stcMDNS_RRHeader::_stcMDNS_RRHeader copy-constructor
 */
MDNSResponder::_stcMDNS_RRHeader::_stcMDNS_RRHeader(const _stcMDNS_RRHeader& p_Other) {
    
    operator=(p_Other);
}

/*
 * MDNSResponder::_stcMDNS_RRHeader::operator =
 */
MDNSResponder::_stcMDNS_RRHeader& MDNSResponder::_stcMDNS_RRHeader::operator=(const MDNSResponder::_stcMDNS_RRHeader& p_Other) {
    
    if (&p_Other != this) {
        m_Domain = p_Other.m_Domain;
        m_Attributes = p_Other.m_Attributes;
    }
    return *this;
}

/*
 * MDNSResponder::_stcMDNS_RRHeader::clear
 */
bool MDNSResponder::_stcMDNS_RRHeader::clear(void) {
    
    m_Domain.clear();
    return true;
}


/**
 * MDNSResponder::stcMDNS_RRQuestion
 *
 * A MDNS question record object (header + question flags)
 *
 */
 
/*
 * MDNSResponder::_stcMDNS_RRQuestion::_stcMDNS_RRQuestion constructor
 */
MDNSResponder::_stcMDNS_RRQuestion::_stcMDNS_RRQuestion(void)
:   m_pNext(0),
    m_bUnicast(false) {
    
}


/**
 * MDNSResponder::stcMDNS_RRAnswer
 *
 * A MDNS answer record object (header + answer content).
 * This is a 'virtual' base class for all other MDNS answer classes.
 *
 */

/*
 * MDNSResponder::_stcMDNS_RRAnswer::_stcMDNS_RRAnswer constructor
 */
MDNSResponder::_stcMDNS_RRAnswer::_stcMDNS_RRAnswer(enuAnswerType p_AnswerType,
                                                    const MDNSResponder::stcMDNS_RRHeader& p_Header,
                                                    uint32_t p_u32TTL)
:   m_pNext(0),
    m_AnswerType(p_AnswerType),
    m_Header(p_Header),
    m_u32TTL(p_u32TTL) {

    // Extract 'cache flush'-bit
    m_bCacheFlush = (m_Header.m_Attributes.m_u16Class & 0x8000);
    m_Header.m_Attributes.m_u16Class &= (~0x8000);
}

/*
 * MDNSResponder::_stcMDNS_RRAnswer::~_stcMDNS_RRAnswer destructor
 */
MDNSResponder::_stcMDNS_RRAnswer::~_stcMDNS_RRAnswer(void) {
    
}

/*
 * MDNSResponder::_stcMDNS_RRAnswer::answerType
 */
MDNSResponder::enuAnswerType MDNSResponder::_stcMDNS_RRAnswer::answerType(void) const {
    
    return m_AnswerType;
}

/*
 * MDNSResponder::_stcMDNS_RRAnswer::clear
 */
bool MDNSResponder::_stcMDNS_RRAnswer::clear(void) {
    
    m_pNext = 0;
    m_Header.clear(); 
    return true;
}


/**
 * MDNSResponder::stcMDNS_RRAnswerA
 *
 * A MDNS A answer object.
 * Extends the base class by an IP4 address member.
 *
 */

#ifdef MDNS_IP4_SUPPORT
    /*
     * MDNSResponder::_stcMDNS_RRAnswerA::stcMDNS_RRAnswerA constructor
     */
    MDNSResponder::_stcMDNS_RRAnswerA::_stcMDNS_RRAnswerA(const MDNSResponder::stcMDNS_RRHeader& p_Header,
                                                          uint32_t p_u32TTL)
    :   stcMDNS_RRAnswer(AnswerType_A, p_Header, p_u32TTL),
        m_IPAddress(0, 0, 0, 0) {
        
