LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
    }

    /*
     * MDNSResponder::_stcMDNS_RRAnswerA::_stcMDNS_RRAnswerA destructor
     */
    MDNSResponder::_stcMDNS_RRAnswerA::~_stcMDNS_RRAnswerA(void) {
        
        clear();
    }

    /*
     * MDNSResponder::_stcMDNS_RRAnswerA::clear
     */
    bool MDNSResponder::_stcMDNS_RRAnswerA::clear(void) {
        
        m_IPAddress = IPAddress(0, 0, 0, 0);
        return true;
    }
#endif


/**
 * MDNSResponder::stcMDNS_RRAnswerPTR
 *
 * A MDNS PTR answer object.
 * Extends the base class by a MDNS domain member.
 *
 */
    
/*
 * MDNSResponder::_stcMDNS_RRAnswerPTR::_stcMDNS_RRAnswerPTR constructor
 */
MDNSResponder::_stcMDNS_RRAnswerPTR::_stcMDNS_RRAnswerPTR(const MDNSResponder::stcMDNS_RRHeader& p_Header,
                                                          uint32_t p_u32TTL)
:   stcMDNS_RRAnswer(AnswerType_PTR, p_Header, p_u32TTL) {

}

/*
 * MDNSResponder::_stcMDNS_RRAnswerPTR::~_stcMDNS_RRAnswerPTR destructor
 */
MDNSResponder::_stcMDNS_RRAnswerPTR::~_stcMDNS_RRAnswerPTR(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNS_RRAnswerPTR::clear
 */
bool MDNSResponder::_stcMDNS_RRAnswerPTR::clear(void) {
    
    m_PTRDomain.clear();
    return true;
}


/**
 * MDNSResponder::_stcMDNS_RRAnswerTXT
 *
 * A MDNS TXT answer object.
 * Extends the base class by a MDNS TXT items list member.
 *
 */
    
/*
 * MDNSResponder::_stcMDNS_RRAnswerTXT::_stcMDNS_RRAnswerTXT constructor
 */
MDNSResponder::_stcMDNS_RRAnswerTXT::_stcMDNS_RRAnswerTXT(const MDNSResponder::stcMDNS_RRHeader& p_Header,
                                                          uint32_t p_u32TTL)
:   stcMDNS_RRAnswer(AnswerType_TXT, p_Header, p_u32TTL) {
    
}
    
/*
 * MDNSResponder::_stcMDNS_RRAnswerTXT::~_stcMDNS_RRAnswerTXT destructor
 */
MDNSResponder::_stcMDNS_RRAnswerTXT::~_stcMDNS_RRAnswerTXT(void) {
    
    clear();
}
    
/*
 * MDNSResponder::_stcMDNS_RRAnswerTXT::clear
 */
bool MDNSResponder::_stcMDNS_RRAnswerTXT::clear(void) {
    
    m_Txts.clear();
    return true;
}


/**
 * MDNSResponder::stcMDNS_RRAnswerAAAA
 *
 * A MDNS AAAA answer object.
 * (Should) extend the base class by an IP6 address member.
 *
 */

#ifdef MDNS_IP6_SUPPORT
    /*
     * MDNSResponder::_stcMDNS_RRAnswerAAAA::_stcMDNS_RRAnswerAAAA constructor
     */
    MDNSResponder::_stcMDNS_RRAnswerAAAA::_stcMDNS_RRAnswerAAAA(const MDNSResponder::stcMDNS_RRHeader& p_Header,
                                                                uint32_t p_u32TTL)
    :   stcMDNS_RRAnswer(AnswerType_AAAA, p_Header, p_u32TTL) {
        
    }

    /*
     * MDNSResponder::_stcMDNS_RRAnswerAAAA::~_stcMDNS_RRAnswerAAAA destructor
     */
    MDNSResponder::_stcMDNS_RRAnswerAAAA::~_stcMDNS_RRAnswerAAAA(void) {
        
        clear();
    }

    /*
     * MDNSResponder::_stcMDNS_RRAnswerAAAA::clear
     */
    bool MDNSResponder::_stcMDNS_RRAnswerAAAA::clear(void) {
        
        return true;
    }
#endif


/**
 * MDNSResponder::stcMDNS_RRAnswerSRV
 *
 * A MDNS SRV answer object.
 * Extends the base class by a port member.
 *
 */

/*
 * MDNSResponder::_stcMDNS_RRAnswerSRV::_stcMDNS_RRAnswerSRV constructor
 */
MDNSResponder::_stcMDNS_RRAnswerSRV::_stcMDNS_RRAnswerSRV(const MDNSResponder::stcMDNS_RRHeader& p_Header,
                                                          uint32_t p_u32TTL)
:   stcMDNS_RRAnswer(AnswerType_SRV, p_Header, p_u32TTL),
    m_u16Priority(0),
    m_u16Weight(0),
    m_u16Port(0) {
    
}

/*
 * MDNSResponder::_stcMDNS_RRAnswerSRV::~_stcMDNS_RRAnswerSRV destructor
 */
MDNSResponder::_stcMDNS_RRAnswerSRV::~_stcMDNS_RRAnswerSRV(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNS_RRAnswerSRV::clear
 */
bool MDNSResponder::_stcMDNS_RRAnswerSRV::clear(void) {
    
    m_u16Priority = 0;
    m_u16Weight = 0;
    m_u16Port = 0;
    m_SRVDomain.clear();
    return true;
}


/**
 * MDNSResponder::stcMDNS_RRAnswerGeneric
 *
 * An unknown (generic) MDNS answer object.
 * Extends the base class by a RDATA buffer member.
 *
 */

/*
 * MDNSResponder::_stcMDNS_RRAnswerGeneric::_stcMDNS_RRAnswerGeneric constructor
 */
MDNSResponder::_stcMDNS_RRAnswerGeneric::_stcMDNS_RRAnswerGeneric(const stcMDNS_RRHeader& p_Header,
                                                                  uint32_t p_u32TTL)
:   stcMDNS_RRAnswer(AnswerType_Generic, p_Header, p_u32TTL),
    m_u16RDLength(0),
    m_pu8RDData(0) {
    
}

/*
 * MDNSResponder::_stcMDNS_RRAnswerGeneric::~_stcMDNS_RRAnswerGeneric destructor
 */
MDNSResponder::_stcMDNS_RRAnswerGeneric::~_stcMDNS_RRAnswerGeneric(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNS_RRAnswerGeneric::clear
 */
bool MDNSResponder::_stcMDNS_RRAnswerGeneric::clear(void) {
    
    if (m_pu8RDData) {
        delete[] m_pu8RDData;
        m_pu8RDData = 0;
    }
    m_u16RDLength = 0;
    
    return true;
}


/**
 * MDNSResponder::stcProbeInformation
 *
 * Probing status information for a host or service domain
 *
 */

/*
 * MDNSResponder::_stcProbeInformation::_stcProbeInformation constructor
 */
MDNSResponder::_stcProbeInformation::_stcProbeInformation(void)
:   m_ProbingStatus(ProbingStatus_WaitingForData),
    m_u8ProbesSent(0),
    m_ulNextProbeTimeout(0),
    m_bConflict(false),
    m_bTiebreakNeeded(false),
    m_fnProbeResultCallback(0),
    m_pProbeResultCallbackUserdata(0) {
}

/*
 * MDNSResponder::_stcProbeInformation::clear
 */
bool MDNSResponder::_stcProbeInformation::clear(bool p_bClearUserdata /*= false*/) {

    m_ProbingStatus = ProbingStatus_WaitingForData;
    m_u8ProbesSent = 0;
    m_ulNextProbeTimeout = 0;
    m_bConflict = false;
    m_bTiebreakNeeded = false;
    if (p_bClearUserdata) {
        m_fnProbeResultCallback = 0;
        m_pProbeResultCallbackUserdata = 0;
    }
    return true;
}

/**
 * MDNSResponder::stcMDNSService
 *
 * A MDNS service object (to be announced by the MDNS responder)
 * The service instance may be '\0'; in this case the hostname is used
 * and the flag m_bAutoName is set. If the hostname changes, all 'auto-
 * named' services are renamed also.
 * m_u8Replymask is used while preparing a response to a MDNS query. It is
 * resetted in '_sendMDNSMessage' afterwards.
 */

