LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
/*
 * MDNSResponder::_stcMDNSService::_stcMDNSService constructor
 */
MDNSResponder::_stcMDNSService::_stcMDNSService(const char* p_pcName /*= 0*/,
                                                const char* p_pcService /*= 0*/,
                                                const char* p_pcProtocol /*= 0*/)
:   m_pNext(0),
    m_pcName(0),
    m_bAutoName(false),
    m_pcService(0),
    m_pcProtocol(0),
    m_u16Port(0),
    m_u8ReplyMask(0),
    m_fnTxtCallback(0),
    m_pTxtCallbackUserdata(0) {
    
    setName(p_pcName);
    setService(p_pcService);
    setProtocol(p_pcProtocol);
}

/*
 * MDNSResponder::_stcMDNSService::~_stcMDNSService destructor
 */
MDNSResponder::_stcMDNSService::~_stcMDNSService(void) {
    
    releaseName();
    releaseService();
    releaseProtocol();
}

/*
 * MDNSResponder::_stcMDNSService::setName
 */
bool MDNSResponder::_stcMDNSService::setName(const char* p_pcName) {
    
    bool bResult = false;
    
    releaseName();
    size_t stLength = (p_pcName ? os_strlen(p_pcName) : 0);
    if (stLength) {
        if ((bResult = (0 != (m_pcName = new char[stLength + 1])))) {
            os_strncpy(m_pcName, p_pcName, stLength);
            m_pcName[stLength] = 0;
        }
    }
    else {
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSService::releaseName
 */
bool MDNSResponder::_stcMDNSService::releaseName(void) {
    
    if (m_pcName) {
        delete[] m_pcName;
        m_pcName = 0;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSService::setService
 */
bool MDNSResponder::_stcMDNSService::setService(const char* p_pcService) {
    
    bool bResult = false;
    
    releaseService();
    size_t stLength = (p_pcService ? os_strlen(p_pcService) : 0);
    if (stLength) {
        if ((bResult = (0 != (m_pcService = new char[stLength + 1])))) {
            os_strncpy(m_pcService, p_pcService, stLength);
            m_pcService[stLength] = 0;
        }
    }
    else {
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSService::releaseService
 */
bool MDNSResponder::_stcMDNSService::releaseService(void) {

    if (m_pcService) {
        delete[] m_pcService;
        m_pcService = 0;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSService::setProtocol
 */
bool MDNSResponder::_stcMDNSService::setProtocol(const char* p_pcProtocol) {

    bool bResult = false;
    
    releaseProtocol();
    size_t stLength = (p_pcProtocol ? os_strlen(p_pcProtocol) : 0);
    if (stLength) {
        if ((bResult = (0 != (m_pcProtocol = new char[stLength + 1])))) {
            os_strncpy(m_pcProtocol, p_pcProtocol, stLength);
            m_pcProtocol[stLength] = 0;
        }
    }
    else {
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSService::releaseProtocol
 */
bool MDNSResponder::_stcMDNSService::releaseProtocol(void) {

    if (m_pcProtocol) {
        delete[] m_pcProtocol;
        m_pcProtocol = 0;
    }
    return true;
}


/**
 * MDNSResponder::stcMDNSServiceQuery
 *
 * A MDNS service query object.
 * Service queries may be static or dynamic.
 * As the static service query is processed in the blocking function 'queryService',
 * only one static service service may exist. The processing of the answers is done
 * on the WiFi-stack side of the ESP stack structure (via 'UDPContext.onRx(_update)').
 *
 */

/**
 * MDNSResponder::stcMDNSServiceQuery::stcAnswer
 *
 * One answer for a service query.
 * Every answer must contain
 * - a service instance entry (pivot),
 * and may contain
 * - a host domain,
 * - a port
 * - an IP4 address
 * (- an IP6 address)
 * - a MDNS TXTs
 * The existance of a component is flaged in 'm_u32ContentFlags'.
 * For every answer component a TTL value is maintained.
 * Answer objects can be connected to a linked list.
 *
 * For the host domain, service domain and TXTs components, a char array
 * representation can be retrieved (which is created on demand).
 *
 */

/**
 * MDNSResponder::stcMDNSServiceQuery::stcAnswer::stcTTL
 *
 * The TTL (Time-To-Live) for an specific answer content.
 * The 80% and outdated states are calculated based on the current time (millis)
 * and the 'set' time (also millis).
 * If the answer is scheduled for an update, the corresponding flag should be set.
 *
 */

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::_stcTTL constructor
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::_stcTTL(uint32_t p_u32TTL /*= 0*/,
                                                                  uint32_t p_u32Millis /*= 0*/)
:   m_bUpdateScheduled(false) {
    
    set(p_u32TTL, p_u32Millis);
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::set
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::set(uint32_t p_u32TTL,
                                                                   uint32_t p_u32Millis) {
    
    m_u32TTL = p_u32TTL;
    m_u32Millis = p_u32Millis;
    m_bUpdateScheduled = false;

    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::has80Percent
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::has80Percent(uint32_t p_u32Now) const {
    
    return ((m_u32Millis) &&
            (!m_bUpdateScheduled) &&
            ((p_u32Now - m_u32Millis) > (m_u32TTL * 800))); // s * 1000ms/s * 80%(0.8, 8/10) = 1000 * 8 / 10 = 100 * 8 = 800
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::isOutdated
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcTTL::isOutdated(uint32_t p_u32Now) const {
    
    return ((m_u32Millis) &&
            ((p_u32Now - m_u32Millis) > (m_u32TTL * 1000)));
}


#ifdef MDNS_IP4_SUPPORT
/**
 * MDNSResponder::stcMDNSServiceQuery::stcAnswer::stcIP4Address
 *
 */

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address::_stcIP4Address constructor
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address::_stcIP4Address(IPAddress p_IPAddress,
                                                                                uint32_t p_u32TTL /*= 0*/,
                                                                                uint32_t p_u32Millis /*= 0*/)
:   m_pNext(0),
    m_IPAddress(p_IPAddress),
    m_TTL(p_u32TTL, p_u32Millis) {
}
#endif


/**
 * MDNSResponder::stcMDNSServiceQuery::stcAnswer
 */

