LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcAnswer constructor
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcAnswer(void)
:   m_pNext(0),
    m_pcServiceDomain(0),
    m_pcHostDomain(0),
    m_u16Port(0),
    m_pcTxts(0),
#ifdef MDNS_IP4_SUPPORT
    m_pIP4Addresses(0),
#endif
#ifdef MDNS_IP6_SUPPORT
    m_pIP6Addresses(0),
#endif
	m_u32ContentFlags(0) {
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::~_stcAnswer destructor
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::~_stcAnswer(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::clear
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::clear(void) {
    
    return ((releaseTxts()) &&
#ifdef MDNS_IP4_SUPPORT
            (releaseIP4Addresses()) &&
#endif
#ifdef MDNS_IP6_SUPPORT
            (releaseIP6Addresses())
#endif
            (releaseHostDomain()) &&
            (releaseServiceDomain()));
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::allocServiceDomain
 *
 * Alloc memory for the char array representation of the service domain.
 *
 */
char* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::allocServiceDomain(size_t p_stLength) {
    
    releaseServiceDomain();
    if (p_stLength) {
        m_pcServiceDomain = new char[p_stLength];
    }
    return m_pcServiceDomain;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseServiceDomain
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseServiceDomain(void) {

    if (m_pcServiceDomain) {
        delete[] m_pcServiceDomain;
        m_pcServiceDomain = 0;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::allocHostDomain
 *
 * Alloc memory for the char array representation of the host domain.
 *
 */
char* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::allocHostDomain(size_t p_stLength) {

    releaseHostDomain();
    if (p_stLength) {
        m_pcHostDomain = new char[p_stLength];
    }
    return m_pcHostDomain;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseHostDomain
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseHostDomain(void) {

    if (m_pcHostDomain) {
        delete[] m_pcHostDomain;
        m_pcHostDomain = 0;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::allocTxts
 *
 * Alloc memory for the char array representation of the TXT items.
 *
 */
char* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::allocTxts(size_t p_stLength) {

    releaseTxts();
    if (p_stLength) {
        m_pcTxts = new char[p_stLength];
    }
    return m_pcTxts;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseTxts
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseTxts(void) {
    
    if (m_pcTxts) {
        delete[] m_pcTxts;
        m_pcTxts = 0;
    }
    return true;
}

#ifdef MDNS_IP4_SUPPORT
/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseIP4Addresses
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseIP4Addresses(void) {
    
    while (m_pIP4Addresses) {
        stcIP4Address*  pNext = m_pIP4Addresses->m_pNext;
        delete m_pIP4Addresses;
        m_pIP4Addresses = pNext;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::addIP4Address
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::addIP4Address(MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address* p_pIP4Address) {
    
    bool bResult = false;
    
    if (p_pIP4Address) {
        p_pIP4Address->m_pNext = m_pIP4Addresses;
        m_pIP4Addresses = p_pIP4Address;
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::removeIP4Address
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::removeIP4Address(MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address* p_pIP4Address) {
    
    bool    bResult = false;
    
    if (p_pIP4Address) {
        stcIP4Address*  pPred = m_pIP4Addresses;
        while ((pPred) &&
               (pPred->m_pNext != p_pIP4Address)) {
            pPred = pPred->m_pNext;
        }
        if (pPred) {
            pPred->m_pNext = p_pIP4Address->m_pNext;
            delete p_pIP4Address;
            bResult = true;
        }
        else if (m_pIP4Addresses == p_pIP4Address) {   // No predecesor, but first item
            m_pIP4Addresses = p_pIP4Address->m_pNext;
            delete p_pIP4Address;
            bResult = true;
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP4Address (const)
 */
const MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP4Address(const IPAddress& p_IPAddress) const {

    return (stcIP4Address*)(((const _stcAnswer*)this)->findIP4Address(p_IPAddress));
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP4Address
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP4Address(const IPAddress& p_IPAddress) {
    
    stcIP4Address*  pIP4Address = m_pIP4Addresses;
    while (pIP4Address) {
        if (pIP4Address->m_IPAddress == p_IPAddress) {
            break;
        }
        pIP4Address = pIP4Address->m_pNext;
    }
    return pIP4Address;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP4AddressCount
 */
uint32_t MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP4AddressCount(void) const {
    
    uint32_t    u32Count = 0;
    
    stcIP4Address*  pIP4Address = m_pIP4Addresses;
    while (pIP4Address) {
        ++u32Count;
        pIP4Address = pIP4Address->m_pNext;
    }
    return u32Count;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP4AddressAtIndex
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP4AddressAtIndex(uint32_t p_u32Index) {

    return (stcIP4Address*)(((const _stcAnswer*)this)->IP4AddressAtIndex(p_u32Index));
}

