LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP4AddressAtIndex (const)
 */
const MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP4Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP4AddressAtIndex(uint32_t p_u32Index) const {
    
    const stcIP4Address*    pIP4Address = 0;
    
    if (((uint32_t)(-1) != p_u32Index) &&
        (m_pIP4Addresses)) {

        uint32_t    u32Index;
        for (pIP4Address=m_pIP4Addresses, u32Index=0; ((pIP4Address) && (u32Index<p_u32Index)); pIP4Address=pIP4Address->m_pNext, ++u32Index);
    }
    return pIP4Address;
}
#endif

#ifdef MDNS_IP6_SUPPORT
/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseIP6Addresses
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::releaseIP6Addresses(void) {
    
    while (m_pIP6Addresses) {
        stcIP6Address*  pNext = m_pIP6Addresses->m_pNext;
        delete m_pIP6Addresses;
        m_pIP6Addresses = pNext;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::addIP6Address
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::addIP6Address(MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP6Address* p_pIP6Address) {
    
    bool bResult = false;
    
    if (p_pIP6Address) {
        p_pIP6Address->m_pNext = m_pIP6Addresses;
        m_pIP6Addresses = p_pIP6Address;
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::removeIP6Address
 */
bool MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::removeIP6Address(MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP6Address* p_pIP6Address) {
    
    bool    bResult = false;
    
    if (p_pIP6Address) {
        stcIP6Address*  pPred = m_pIP6Addresses;
        while ((pPred) &&
               (pPred->m_pNext != p_pIP6Address)) {
            pPred = pPred->m_pNext;
        }
        if (pPred) {
            pPred->m_pNext = p_pIP6Address->m_pNext;
            delete p_pIP6Address;
            bResult = true;
        }
        else if (m_pIP6Addresses == p_pIP6Address) {   // No predecesor, but first item
            m_pIP6Addresses = p_pIP6Address->m_pNext;
            delete p_pIP6Address;
            bResult = true;
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP6Address
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP6Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP6Address(const IP6Address& p_IPAddress) {

    return (stcIP6Address*)(((const _stcAnswer*)this)->findIP6Address(p_IPAddress));
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP6Address (const)
 */
const MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP6Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::findIP6Address(const IPAddress& p_IPAddress) const {
    
    const stcIP6Address*    pIP6Address = m_pIP6Addresses;
    while (pIP6Address) {
        if (p_IP6Address->m_IPAddress == p_IPAddress) {
            break;
        }
        pIP6Address = pIP6Address->m_pNext;
    }
    return pIP6Address;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP6AddressCount
 */
uint32_t MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP6AddressCount(void) const {
    
    uint32_t    u32Count = 0;
    
    stcIP6Address*  pIP6Address = m_pIP6Addresses;
    while (pIP6Address) {
        ++u32Count;
        pIP6Address = pIP6Address->m_pNext;
    }
    return u32Count;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP6AddressAtIndex (const)
 */
const MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP6Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP6AddressAtIndex(uint32_t p_u32Index) const {

    return (stcIP6Address*)(((const _stcAnswer*)this)->IP6AddressAtIndex(p_u32Index));
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP6AddressAtIndex
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::_stcIP6Address* MDNSResponder::_stcMDNSServiceQuery::_stcAnswer::IP6AddressAtIndex(uint32_t p_u32Index) {
    
    stcIP6Address*    pIP6Address = 0;
    
    if (((uint32_t)(-1) != p_u32Index) &&
        (m_pIP6Addresses)) {

        uint32_t    u32Index;
        for (pIP6Address=m_pIP6Addresses, u32Index=0; ((pIP6Address) && (u32Index<p_u32Index)); pIP6Address=pIP6Address->m_pNext, ++u32Index);
    }
    return pIP6Address;
}
#endif


/**
 * MDNSResponder::stcMDNSServiceQuery
 *
 * A service query object.
 * A static query is flaged via 'm_bLegacyQuery'; while the function 'queryService'
 * is waiting for answers, the internal flag 'm_bAwaitingAnswers' is set. When the
 * timeout is reached, the flag is removed. These two flags are only used for static
 * service queries.
 * All answers to the service query are stored in 'm_pAnswers' list.
 * Individual answers may be addressed by index (in the list of answers).
 * Every time a answer component is added (or changes) in a dynamic service query,
 * the callback 'm_fnCallback' is called.
 * The answer list may be searched by service and host domain.
 *
 * Service query object may be connected to a linked list.
 */

/*
 * MDNSResponder::_stcMDNSServiceQuery::_stcMDNSServiceQuery constructor
 */
MDNSResponder::_stcMDNSServiceQuery::_stcMDNSServiceQuery(void)
:   m_pNext(0),
    m_fnCallback(0),
    m_pUserdata(0),
    m_bLegacyQuery(false),
    m_bAwaitingAnswers(true),
    m_pAnswers(0) {

    clear();
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::~_stcMDNSServiceQuery destructor
 */
MDNSResponder::_stcMDNSServiceQuery::~_stcMDNSServiceQuery(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::clear
 */
bool MDNSResponder::_stcMDNSServiceQuery::clear(void) {
    
    m_fnCallback = 0;
    m_pUserdata = 0;
    m_bLegacyQuery = false;
    m_bAwaitingAnswers = true;
    while (m_pAnswers) {
        stcAnswer*  pNext = m_pAnswers->m_pNext;
        delete m_pAnswers;
        m_pAnswers = pNext;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::answerCount
 */
uint32_t MDNSResponder::_stcMDNSServiceQuery::answerCount(void) const {
    
