LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Structs.cpp
    uint32_t    u32Count = 0;
    
    stcAnswer*  pAnswer = m_pAnswers;
    while (pAnswer) {
        ++u32Count;
        pAnswer = pAnswer->m_pNext;
    }
    return u32Count;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::answerAtIndex
 */
const MDNSResponder::_stcMDNSServiceQuery::_stcAnswer* MDNSResponder::_stcMDNSServiceQuery::answerAtIndex(uint32_t p_u32Index) const {
    
    const stcAnswer*    pAnswer = 0;
    
    if (((uint32_t)(-1) != p_u32Index) &&
        (m_pAnswers)) {

        uint32_t    u32Index;
        for (pAnswer=m_pAnswers, u32Index=0; ((pAnswer) && (u32Index<p_u32Index)); pAnswer=pAnswer->m_pNext, ++u32Index);
    }
    return pAnswer;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::answerAtIndex
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer* MDNSResponder::_stcMDNSServiceQuery::answerAtIndex(uint32_t p_u32Index) {
    
    return (stcAnswer*)(((const _stcMDNSServiceQuery*)this)->answerAtIndex(p_u32Index));
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::indexOfAnswer
 */
uint32_t MDNSResponder::_stcMDNSServiceQuery::indexOfAnswer(const MDNSResponder::_stcMDNSServiceQuery::_stcAnswer* p_pAnswer) const {
    
    uint32_t    u32Index = 0;
    
    for (const stcAnswer* pAnswer=m_pAnswers; pAnswer; pAnswer=pAnswer->m_pNext, ++u32Index) {
        if (pAnswer == p_pAnswer) {
            return u32Index;
        }
    }
    return ((uint32_t)(-1));
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::addAnswer
 */
bool MDNSResponder::_stcMDNSServiceQuery::addAnswer(MDNSResponder::_stcMDNSServiceQuery::_stcAnswer* p_pAnswer) {
    
    bool    bResult = false;
    
    if (p_pAnswer) {
        p_pAnswer->m_pNext = m_pAnswers;
        m_pAnswers = p_pAnswer;
        bResult = true;
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::removeAnswer
 */
bool MDNSResponder::_stcMDNSServiceQuery::removeAnswer(MDNSResponder::_stcMDNSServiceQuery::_stcAnswer* p_pAnswer) {
    
    bool    bResult = false;
    
    if (p_pAnswer) {
        stcAnswer*  pPred = m_pAnswers;
        while ((pPred) &&
               (pPred->m_pNext != p_pAnswer)) {
            pPred = pPred->m_pNext;
        }
        if (pPred) {
            pPred->m_pNext = p_pAnswer->m_pNext;
            delete p_pAnswer;
            bResult = true;
        }
        else if (m_pAnswers == p_pAnswer) { // No predecesor, but first item
            m_pAnswers = p_pAnswer->m_pNext;
            delete p_pAnswer;
            bResult = true;
        }
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::findAnswerForServiceDomain
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer* MDNSResponder::_stcMDNSServiceQuery::findAnswerForServiceDomain(const MDNSResponder::stcMDNS_RRDomain& p_ServiceDomain) {
    
    stcAnswer*  pAnswer = m_pAnswers;
    while (pAnswer) {
        if (pAnswer->m_ServiceDomain == p_ServiceDomain) {
            break;
        }
        pAnswer = pAnswer->m_pNext;
    }
    return pAnswer;
}

/*
 * MDNSResponder::_stcMDNSServiceQuery::findAnswerForHostDomain
 */
MDNSResponder::_stcMDNSServiceQuery::_stcAnswer* MDNSResponder::_stcMDNSServiceQuery::findAnswerForHostDomain(const MDNSResponder::stcMDNS_RRDomain& p_HostDomain) {

    stcAnswer*  pAnswer = m_pAnswers;
    while (pAnswer) {
        if (pAnswer->m_HostDomain == p_HostDomain) {
            break;
        }
        pAnswer = pAnswer->m_pNext;
    }
    return pAnswer;
}


/**
 * MDNSResponder::stcMDNSSendParameter
 *
 * A 'collection' of properties and flags for one MDNS query or response.
 * Mainly managed by the 'Control' functions.
 * The current offset in the UPD output buffer is tracked to be able to do
 * a simple host or service domain compression.
 * 
 */

/**
 * MDNSResponder::stcMDNSSendParameter::stcDomainCacheItem
 *
 * A cached host or service domain, incl. the offset in the UDP output buffer.
 *
 */

/*
 * MDNSResponder::stcMDNSSendParameter::_stcDomainCacheItem::_stcDomainCacheItem constructor
 */
MDNSResponder::stcMDNSSendParameter::_stcDomainCacheItem::_stcDomainCacheItem(const void* p_pHostnameOrService,
                                                                              bool p_bAdditionalData,
                                                                              uint32_t p_u16Offset)
:   m_pNext(0),
    m_pHostnameOrService(p_pHostnameOrService),
    m_bAdditionalData(p_bAdditionalData),
    m_u16Offset(p_u16Offset) {
    
}

/**
 * MDNSResponder::stcMDNSSendParameter
 */

/*
 * MDNSResponder::_stcMDNSSendParameter::_stcMDNSSendParameter constructor
 */
MDNSResponder::_stcMDNSSendParameter::_stcMDNSSendParameter(void)
:   m_pQuestions(0),
    m_pDomainCacheItems(0) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNSSendParameter::~_stcMDNSSendParameter destructor
 */
MDNSResponder::_stcMDNSSendParameter::~_stcMDNSSendParameter(void) {
    
    clear();
}

/*
 * MDNSResponder::_stcMDNSSendParameter::clear
 */
bool MDNSResponder::_stcMDNSSendParameter::clear(void) {

    m_u16ID = 0;
    m_u8HostReplyMask = 0;
    m_u16Offset = 0;

    m_bLegacyQuery = false;
    m_bResponse = false;
    m_bAuthorative = false;
    m_bUnicast = false;
    m_bUnannounce = false;
    
    m_bCacheFlush = true;
    
    while (m_pQuestions) {
        stcMDNS_RRQuestion* pNext = m_pQuestions->m_pNext;
        delete m_pQuestions;
        m_pQuestions = pNext;
    }
    while (m_pDomainCacheItems) {
        stcDomainCacheItem* pNext = m_pDomainCacheItems->m_pNext;
        delete m_pDomainCacheItems;
        m_pDomainCacheItems = pNext;
    }
    return true;
}

/*
 * MDNSResponder::_stcMDNSSendParameter::shiftOffset
 */
bool MDNSResponder::_stcMDNSSendParameter::shiftOffset(uint16_t p_u16Shift) {

    m_u16Offset += p_u16Shift;
    return true;
}

/*
 * MDNSResponder::_stcMDNSSendParameter::addDomainCacheItem
 */
bool MDNSResponder::_stcMDNSSendParameter::addDomainCacheItem(const void* p_pHostnameOrService,
                                                              bool p_bAdditionalData,
                                                              uint16_t p_u16Offset) {
    
    bool    bResult = false;
    
    stcDomainCacheItem* pNewItem = 0;
    if ((p_pHostnameOrService) &&
        (p_u16Offset) &&
        ((pNewItem = new stcDomainCacheItem(p_pHostnameOrService, p_bAdditionalData, p_u16Offset)))) {
        
        pNewItem->m_pNext = m_pDomainCacheItems;
        bResult = ((m_pDomainCacheItems = pNewItem));
    }
    return bResult;
}

/*
 * MDNSResponder::_stcMDNSSendParameter::findCachedDomainOffset
 */
uint16_t MDNSResponder::_stcMDNSSendParameter::findCachedDomainOffset(const void* p_pHostnameOrService,
                                                                      bool p_bAdditionalData) const {
    
    const stcDomainCacheItem*   pCacheItem = m_pDomainCacheItems;
    
    for (; pCacheItem; pCacheItem=pCacheItem->m_pNext) {
        if ((pCacheItem->m_pHostnameOrService == p_pHostnameOrService) &&
            (pCacheItem->m_bAdditionalData == p_bAdditionalData)) { // Found cache item
            break;
        }
    }
    return (pCacheItem ? pCacheItem->m_u16Offset : 0);
}

}   // namespace LEA_MDNSResponder




